nxp-mcuxpresso/mcux-sdk/devices/MCXN235/MCXN235.h
#define SYSCON_PRESETCTRL3_PWM1_RST_MASK         (0x80U)
#define SYSCON_PRESETCTRL3_PWM1_RST_SHIFT        (7U)
/*! PWM1_RST - PWM1 reset control
 *  0b1..Block is reset
 *  0b0..Block is not reset
 */
#define SYSCON_PRESETCTRL3_PWM1_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_PWM1_RST_SHIFT)) & SYSCON_PRESETCTRL3_PWM1_RST_MASK)

#define SYSCON_PRESETCTRL3_AOI0_RST_MASK         (0x100U)
#define SYSCON_PRESETCTRL3_AOI0_RST_SHIFT        (8U)
/*! AOI0_RST - AOI0 reset control
 *  0b1..Block is reset
 *  0b0..Block is not reset
 */
#define SYSCON_PRESETCTRL3_AOI0_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_AOI0_RST_SHIFT)) & SYSCON_PRESETCTRL3_AOI0_RST_MASK)

#define SYSCON_PRESETCTRL3_VREF_RST_MASK         (0x80000U)
#define SYSCON_PRESETCTRL3_VREF_RST_SHIFT        (19U)
/*! VREF_RST - VREF reset control
 *  0b1..Block is reset
 *  0b0..Block is not reset
 */
#define SYSCON_PRESETCTRL3_VREF_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_VREF_RST_SHIFT)) & SYSCON_PRESETCTRL3_VREF_RST_MASK)

#define SYSCON_PRESETCTRL3_EWM_RST_MASK          (0x800000U)
#define SYSCON_PRESETCTRL3_EWM_RST_SHIFT         (23U)
/*! EWM_RST - EWM reset control
 *  0b1..Block is reset
 *  0b0..Block is not reset
 */
#define SYSCON_PRESETCTRL3_EWM_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_EWM_RST_SHIFT)) & SYSCON_PRESETCTRL3_EWM_RST_MASK)

#define SYSCON_PRESETCTRL3_EIM_RST_MASK          (0x1000000U)
#define SYSCON_PRESETCTRL3_EIM_RST_SHIFT         (24U)
/*! EIM_RST - EIM reset control
 *  0b1..Block is reset
 *  0b0..Block is not reset
 */
#define SYSCON_PRESETCTRL3_EIM_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_EIM_RST_SHIFT)) & SYSCON_PRESETCTRL3_EIM_RST_MASK)
/*! @} */

/*! @name PRESETCTRLSET - Peripheral Reset Control Set */
/*! @{ */

#define SYSCON_PRESETCTRLSET_DATA_MASK           (0xFFFFFFFFU)
#define SYSCON_PRESETCTRLSET_DATA_SHIFT          (0U)
/*! DATA - Data array value, refer to corresponding position in PRESETCTRLn. */
#define SYSCON_PRESETCTRLSET_DATA(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRLSET_DATA_SHIFT)) & SYSCON_PRESETCTRLSET_DATA_MASK)
/*! @} */

/* The count of SYSCON_PRESETCTRLSET */
#define SYSCON_PRESETCTRLSET_COUNT               (4U)

/*! @name PRESETCTRLCLR - Peripheral Reset Control Clear */
/*! @{ */

#define SYSCON_PRESETCTRLCLR_DATA_MASK           (0xFFFFFFFFU)
#define SYSCON_PRESETCTRLCLR_DATA_SHIFT          (0U)
/*! DATA - Data array value, refer to corresponding position in PRESETCTRLn. */
#define SYSCON_PRESETCTRLCLR_DATA(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRLCLR_DATA_SHIFT)) & SYSCON_PRESETCTRLCLR_DATA_MASK)
/*! @} */

/* The count of SYSCON_PRESETCTRLCLR */
#define SYSCON_PRESETCTRLCLR_COUNT               (4U)

/*! @name AHBCLKCTRL0 - AHB Clock Control 0 */
/*! @{ */

#define SYSCON_AHBCLKCTRL0_ROM_MASK              (0x2U)
#define SYSCON_AHBCLKCTRL0_ROM_SHIFT             (1U)
/*! ROM - Enables the clock for the ROM
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_ROM(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_ROM_SHIFT)) & SYSCON_AHBCLKCTRL0_ROM_MASK)

#define SYSCON_AHBCLKCTRL0_RAMB_CTRL_MASK        (0x4U)
#define SYSCON_AHBCLKCTRL0_RAMB_CTRL_SHIFT       (2U)
/*! RAMB_CTRL - Enables the clock for the RAMB Controller
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_RAMB_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_RAMB_CTRL_SHIFT)) & SYSCON_AHBCLKCTRL0_RAMB_CTRL_MASK)

#define SYSCON_AHBCLKCTRL0_RAMC_CTRL_MASK        (0x8U)
#define SYSCON_AHBCLKCTRL0_RAMC_CTRL_SHIFT       (3U)
/*! RAMC_CTRL - Enables the clock for the RAMC Controller
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_RAMC_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_RAMC_CTRL_SHIFT)) & SYSCON_AHBCLKCTRL0_RAMC_CTRL_MASK)

#define SYSCON_AHBCLKCTRL0_RAMD_CTRL_MASK        (0x10U)
#define SYSCON_AHBCLKCTRL0_RAMD_CTRL_SHIFT       (4U)
/*! RAMD_CTRL - Enables the clock for the RAMD Controller
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_RAMD_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_RAMD_CTRL_SHIFT)) & SYSCON_AHBCLKCTRL0_RAMD_CTRL_MASK)

#define SYSCON_AHBCLKCTRL0_RAME_CTRL_MASK        (0x20U)
#define SYSCON_AHBCLKCTRL0_RAME_CTRL_SHIFT       (5U)
/*! RAME_CTRL - Enables the clock for the RAME Controller
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_RAME_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_RAME_CTRL_SHIFT)) & SYSCON_AHBCLKCTRL0_RAME_CTRL_MASK)

#define SYSCON_AHBCLKCTRL0_FMU_MASK              (0x200U)
#define SYSCON_AHBCLKCTRL0_FMU_SHIFT             (9U)
/*! FMU - Enables the clock for the Flash Management Unit
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_FMU(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_FMU_SHIFT)) & SYSCON_AHBCLKCTRL0_FMU_MASK)

#define SYSCON_AHBCLKCTRL0_FMC_MASK              (0x400U)
#define SYSCON_AHBCLKCTRL0_FMC_SHIFT             (10U)
/*! FMC - Enables the clock for the Flash Memory Controller
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_FMC(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_FMC_SHIFT)) & SYSCON_AHBCLKCTRL0_FMC_MASK)

#define SYSCON_AHBCLKCTRL0_MUX_MASK              (0x1000U)
#define SYSCON_AHBCLKCTRL0_MUX_SHIFT             (12U)
/*! MUX - Enables the clock for INPUTMUX
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_MUX(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_MUX_SHIFT)) & SYSCON_AHBCLKCTRL0_MUX_MASK)

#define SYSCON_AHBCLKCTRL0_PORT0_MASK            (0x2000U)
#define SYSCON_AHBCLKCTRL0_PORT0_SHIFT           (13U)
/*! PORT0 - Enables the clock for PORT0 controller
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT0(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT0_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT0_MASK)

#define SYSCON_AHBCLKCTRL0_PORT1_MASK            (0x4000U)
#define SYSCON_AHBCLKCTRL0_PORT1_SHIFT           (14U)
/*! PORT1 - Enables the clock for PORT1
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT1(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT1_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT1_MASK)

#define SYSCON_AHBCLKCTRL0_PORT2_MASK            (0x8000U)
#define SYSCON_AHBCLKCTRL0_PORT2_SHIFT           (15U)
/*! PORT2 - Enables the clock for PORT2
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT2(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT2_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT2_MASK)

#define SYSCON_AHBCLKCTRL0_PORT3_MASK            (0x10000U)
#define SYSCON_AHBCLKCTRL0_PORT3_SHIFT           (16U)
/*! PORT3 - Enables the clock for PORT3
 *  0b1..Enables clock
 *  0b0..Disables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT3(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT3_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT3_MASK)

