nxp-mcuxpresso/mcux-sdk/devices/MCXN235/MCXN235.h
#define USBHS_ENDPTCOMPLETE_ERCE_MASK            (0xFFU)
#define USBHS_ENDPTCOMPLETE_ERCE_SHIFT           (0U)
/*! ERCE - Endpoint Receive Complete Event */
#define USBHS_ENDPTCOMPLETE_ERCE(x)              (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCOMPLETE_ERCE_SHIFT)) & USBHS_ENDPTCOMPLETE_ERCE_MASK)

#define USBHS_ENDPTCOMPLETE_ETCE_MASK            (0xFF0000U)
#define USBHS_ENDPTCOMPLETE_ETCE_SHIFT           (16U)
/*! ETCE - Endpoint Transmit Complete Event */
#define USBHS_ENDPTCOMPLETE_ETCE(x)              (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCOMPLETE_ETCE_SHIFT)) & USBHS_ENDPTCOMPLETE_ETCE_MASK)
/*! @} */

/*! @name ENDPTCTRL0 - Endpoint Control 0 */
/*! @{ */

#define USBHS_ENDPTCTRL0_RXS_MASK                (0x1U)
#define USBHS_ENDPTCTRL0_RXS_SHIFT               (0U)
/*! RXS - RX Endpoint Stall
 *  0b0..Endpoint OK
 *  0b1..Endpoint stalled
 */
#define USBHS_ENDPTCTRL0_RXS(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL0_RXS_SHIFT)) & USBHS_ENDPTCTRL0_RXS_MASK)

#define USBHS_ENDPTCTRL0_RXT_MASK                (0xCU)
#define USBHS_ENDPTCTRL0_RXT_SHIFT               (2U)
/*! RXT - RX Endpoint Type
 *  0b00..Control
 */
#define USBHS_ENDPTCTRL0_RXT(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL0_RXT_SHIFT)) & USBHS_ENDPTCTRL0_RXT_MASK)

#define USBHS_ENDPTCTRL0_RXE_MASK                (0x80U)
#define USBHS_ENDPTCTRL0_RXE_SHIFT               (7U)
/*! RXE - RX Endpoint Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_ENDPTCTRL0_RXE(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL0_RXE_SHIFT)) & USBHS_ENDPTCTRL0_RXE_MASK)

#define USBHS_ENDPTCTRL0_TXS_MASK                (0x10000U)
#define USBHS_ENDPTCTRL0_TXS_SHIFT               (16U)
/*! TXS - TX Endpoint Stall
 *  0b0..Endpoint OK
 *  0b1..Endpoint stalled
 */
#define USBHS_ENDPTCTRL0_TXS(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL0_TXS_SHIFT)) & USBHS_ENDPTCTRL0_TXS_MASK)

#define USBHS_ENDPTCTRL0_TXT_MASK                (0xC0000U)
#define USBHS_ENDPTCTRL0_TXT_SHIFT               (18U)
/*! TXT - TX Endpoint Type
 *  0b00..Control
 */
#define USBHS_ENDPTCTRL0_TXT(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL0_TXT_SHIFT)) & USBHS_ENDPTCTRL0_TXT_MASK)

#define USBHS_ENDPTCTRL0_TXE_MASK                (0x800000U)
#define USBHS_ENDPTCTRL0_TXE_SHIFT               (23U)
/*! TXE - TX Endpoint Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_ENDPTCTRL0_TXE(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL0_TXE_SHIFT)) & USBHS_ENDPTCTRL0_TXE_MASK)
/*! @} */

/*! @name ENDPTCTRL - Endpoint Control 1..Endpoint Control 7 */
/*! @{ */

#define USBHS_ENDPTCTRL_RXS_MASK                 (0x1U)
#define USBHS_ENDPTCTRL_RXS_SHIFT                (0U)
/*! RXS - RX Endpoint Stall
 *  0b0..Endpoint OK
 *  0b1..Endpoint stalled
 */
#define USBHS_ENDPTCTRL_RXS(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_RXS_SHIFT)) & USBHS_ENDPTCTRL_RXS_MASK)

#define USBHS_ENDPTCTRL_RXD_MASK                 (0x2U)
#define USBHS_ENDPTCTRL_RXD_SHIFT                (1U)
/*! RXD - RX Endpoint Data Sink
 *  0b0..Dual Port Memory Buffer/DMA Engine
 */
#define USBHS_ENDPTCTRL_RXD(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_RXD_SHIFT)) & USBHS_ENDPTCTRL_RXD_MASK)

#define USBHS_ENDPTCTRL_RXT_MASK                 (0xCU)
#define USBHS_ENDPTCTRL_RXT_SHIFT                (2U)
/*! RXT - RX Endpoint Type
 *  0b00..Control
 *  0b01..Isochronous
 *  0b10..Bulk
 *  0b11..Interrupt
 */
#define USBHS_ENDPTCTRL_RXT(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_RXT_SHIFT)) & USBHS_ENDPTCTRL_RXT_MASK)

#define USBHS_ENDPTCTRL_RXI_MASK                 (0x20U)
#define USBHS_ENDPTCTRL_RXI_SHIFT                (5U)
/*! RXI - RX Data Toggle Inhibit
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_ENDPTCTRL_RXI(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_RXI_SHIFT)) & USBHS_ENDPTCTRL_RXI_MASK)

#define USBHS_ENDPTCTRL_RXR_MASK                 (0x40U)
#define USBHS_ENDPTCTRL_RXR_SHIFT                (6U)
/*! RXR - RX Data Toggle Reset (WS)
 *  0b1..Reset PID sequence
 */
#define USBHS_ENDPTCTRL_RXR(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_RXR_SHIFT)) & USBHS_ENDPTCTRL_RXR_MASK)

#define USBHS_ENDPTCTRL_RXE_MASK                 (0x80U)
#define USBHS_ENDPTCTRL_RXE_SHIFT                (7U)
/*! RXE - RX Endpoint Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_ENDPTCTRL_RXE(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_RXE_SHIFT)) & USBHS_ENDPTCTRL_RXE_MASK)

#define USBHS_ENDPTCTRL_TXS_MASK                 (0x10000U)
#define USBHS_ENDPTCTRL_TXS_SHIFT                (16U)
/*! TXS - TX Endpoint Stall
 *  0b0..Endpoint OK
 *  0b1..Endpoint stalled
 */
#define USBHS_ENDPTCTRL_TXS(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_TXS_SHIFT)) & USBHS_ENDPTCTRL_TXS_MASK)

#define USBHS_ENDPTCTRL_TXD_MASK                 (0x20000U)
#define USBHS_ENDPTCTRL_TXD_SHIFT                (17U)
/*! TXD - TX Endpoint Data Source
 *  0b0..Dual Port Memory Buffer/DMA Engine
 */
#define USBHS_ENDPTCTRL_TXD(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_TXD_SHIFT)) & USBHS_ENDPTCTRL_TXD_MASK)

#define USBHS_ENDPTCTRL_TXT_MASK                 (0xC0000U)
#define USBHS_ENDPTCTRL_TXT_SHIFT                (18U)
/*! TXT - TX Endpoint Type
 *  0b00..Control
 *  0b01..Isochronous
 *  0b10..Bulk
 *  0b11..Interrupt
 */
#define USBHS_ENDPTCTRL_TXT(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_TXT_SHIFT)) & USBHS_ENDPTCTRL_TXT_MASK)

#define USBHS_ENDPTCTRL_TXI_MASK                 (0x200000U)
#define USBHS_ENDPTCTRL_TXI_SHIFT                (21U)
/*! TXI - TX Data Toggle Inhibit
 *  0b0..PID sequencing enabled
 *  0b1..PID sequencing disabled
 */
#define USBHS_ENDPTCTRL_TXI(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_TXI_SHIFT)) & USBHS_ENDPTCTRL_TXI_MASK)

#define USBHS_ENDPTCTRL_TXR_MASK                 (0x400000U)
#define USBHS_ENDPTCTRL_TXR_SHIFT                (22U)
/*! TXR - TX Data Toggle Reset (WS)
 *  0b1..Reset PID sequence
 */
#define USBHS_ENDPTCTRL_TXR(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_ENDPTCTRL_TXR_SHIFT)) & USBHS_ENDPTCTRL_TXR_MASK)

